<?php
//sae配置文件
if (!function_exists('sae_debug')) {
    return [];
}
return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    // 关闭调试模式
    // 'app_debug' => false,

    // +----------------------------------------------------------------------
    // | 异常及错误设置
    // +----------------------------------------------------------------------

    // 异常页面的模板文件
    'exception_tmpl'         => APP_PATH . 'my_exception.tpl',

    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------
    // 数据库类型
    'type'        => 'mysql',
    // 服务器地址
    'hostname'    => SAE_MYSQL_HOST_M . ',' . SAE_MYSQL_HOST_S,
    // 数据库名
    'database'    => SAE_MYSQL_DB,
    // 用户名
    'username'    => SAE_MYSQL_USER,
    // 密码
    'password'    => SAE_MYSQL_PASS,
    // 端口
    'hostport'    => SAE_MYSQL_PORT,
    // 数据库部署方式:0 集中式(单一服务器),1 分布式(主从服务器)
    'deploy'      => 1,

    // +----------------------------------------------------------------------
    // | 日志设置
    // +----------------------------------------------------------------------
    'log'       =>  [
        'type'  => '\osnobel\sae\Log',
    ],

    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------
    'template'  =>  [
        // 模板引擎类型 支持 php think 支持扩展
        'type'         => 'Think',
        'compile_type'  =>  '\osnobel\sae\template\Memcached',
        // 模板引擎普通标签开始标记
        'tpl_begin'    => '{',
        // 模板引擎普通标签结束标记
        'tpl_end'      => '}',
        // 标签库标签开始标记
        'taglib_begin' => '{',
        // 标签库标签结束标记
        'taglib_end'   => '}',
    ],

    // +----------------------------------------------------------------------
    // | 缓存设置
    // +----------------------------------------------------------------------
    'cache'     =>  [
        // 驱动方式
        'type'   => '\osnobel\sae\cache\Memcached',
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],
];

